app/views/books/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 4]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 4]]
---
			<div class="average-review-rating" data-score=<%= @average_review %>></div>
			<span class="number-of-reviews">Berdasarkan <%= @book.reviews.count %> reviews</span>