app/controllers/books_controller.rb

	def create
		@categories = [['Fantasi', 1], ['Teknologi', 2], ['Biografi', 3]]
		@book = current_user.books.build(book_params)
		@book.category_id = params[:category_id]

		if @book.save
---
INSERT INTO "books" ("title", "description", "author", "book_img_file_name", "book_img_content_type", "book_img_file_size", "book_img_updated_at", "user_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

	def update
		@book.category_id = params[:category_id]
		if @book.update(book_params)
---
UPDATE "books" SET "title" = ?, "description" = ?, "author" = ?, "category_id" = ?, "book_img_file_name" = ?, "book_img_content_type" = ?, "book_img_file_size" = ?, "book_img_updated_at" = ?, "updated_at" = ? WHERE "books"."id" = ?